app/Http/Controllers/Api/CategoryController.php

update `categories` set `name` = 'Educational Test', `categories`.`updated_at` = '2021-09-20 09:52:08' where `id` = 41
---
        public function update(Request $request)
        {
            $request->validate([
                'name' => 'required|string|min:3'
            ]);

            $category = Category::findOrFail($request->id);
            $category->update($request->all());