app/Http/Controllers/Api/UserController.php

    public function update(Request $request)
    {
        $request->validate([
            'name' => 'required|string|min:3',
            'email' => 'required|regex:/(.+)@(.+)\.(.+)/i'
        ]);

        $user = User::findOrFail($request->id);
        $user->update($request->all());
---
update `users` set `name` = 'Richard', `users`.`updated_at` = '2021-09-24 14:39:41' where `id` = 1