app/Http/Controllers/CategoryController.php

select * from `categories`
---
        public function index()
        {
            $view = View('category.index');
            $view->Categories = Category::all();