app/Http/Controllers/GameController.php

select * from `games` where `games`.`deleted_at` is null
---
        public function index()
        {
            $view = View('game.index');
            $view->games = Game::all();

select * from `users` where `users`.`id` = 1 and `users`.`deleted_at` is null limit 1
select `games`.*, `game_user`.`user_id` as `pivot_user_id`, `game_user`.`game_id` as `pivot_game_id`, `game_user`.`created_at` as `pivot_created_at`, `game_user`.`updated_at` as `pivot_updated_at` from `games` inner join `game_user` on `games`.`id` = `game_user`.`game_id` where `game_user`.`user_id` in (1) and `games`.`deleted_at` is null
insert into `game_user` (`created_at`, `game_id`, `updated_at`, `user_id`) values ('2021-09-21 08:28:23', 1, '2021-09-21 08:28:23', 1)
---
        public function addLink(int $id)
        {
            $game = Game::findOrFail($id);
            $user = User::with('games')->find(Auth::id());

            if ($user->games->contains($id))
                return redirect()->route('game.index')->with('error', "<b>\"{$game->name}\"</b> is already linked to your account.");

            $user->games()->attach($game);

select * from `users` where `users`.`id` = 1 and `users`.`deleted_at` is null limit 1
select `games`.*, `game_user`.`user_id` as `pivot_user_id`, `game_user`.`game_id` as `pivot_game_id`, `game_user`.`created_at` as `pivot_created_at`, `game_user`.`updated_at` as `pivot_updated_at` from `games` inner join `game_user` on `games`.`id` = `game_user`.`game_id` where `game_user`.`user_id` in (1) and `games`.`deleted_at` is null
delete from `game_user` where `user_id` = 1 and `game_id` in (1)
---
        public function removeLink(int $id)
        {
            $game = Game::findOrFail($id);
            $user = User::with('games')->find(Auth::id());

            if (!$user->games->contains($id))
                return redirect()->route('game.index')->with('error', "<b>\"{$game->name}\"</b> is still linked to your account.");

            $user->games()->detach($game);