app/Http/Controllers/UserController.php

        public function index()
        {
            $view = View('user.index');
            $view->users = User::all();
---
select * from `users` where `users`.`deleted_at` is null

        public function show(int $id)
        {
            $view = View('user.show');
            $view->user = User::with('games')->findOrFail($id);
---
select * from `users` where `users`.`id` = 1 and `users`.`deleted_at` is null limit 1
select `games`.*, `game_user`.`user_id` as `pivot_user_id`, `game_user`.`game_id` as `pivot_game_id`, `game_user`.`created_at` as `pivot_created_at`, `game_user`.`updated_at` as `pivot_updated_at` from `games` inner join `game_user` on `games`.`id` = `game_user`.`game_id` where `game_user`.`user_id` in (1) and `games`.`deleted_at` is null